Autodesk.Revit.DB.CurveExtents.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.CurveExtents.EndParameter
The end parameter of the curve extents.
Since:
2013

Autodesk.Revit.DB.CurveExtents.StartParameter
The start parameter of the curve extents.
Since:
2013

Autodesk.Revit.DB.CurveExtents
Represents the start and end parameters for a curve segment.
Since:
2013